app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @car = Car.find(params[:id])

INSERT INTO "cars" ("year", "make", "model", "price", "person_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["year", 2002], ["make", "Audi"], ["model", "A6"], ["price", 5000], ["person_id", 1], ["created_at", "2022-06-24 07:35:40.523765"], ["updated_at", "2022-06-24 07:35:40.523765"]]
---
    def create
        @car = Car.new(car_params)

        if(@car.save)